### Pandas Data Structure : Data Frame And Series

##### Series

In [ ]:
# Series is one Dimensional label array capable of holding any data type ,
# its like a column in a spreadsheet.

In [2]:
import pandas as pd

In [3]:
data =[10,20,30,40,50]
series =pd.Series(data ,index=['a','b','c','d','e'],name='Number')

print(series)

a    10
b    20
c    30
d    40
e    50
Name: Number, dtype: int64

## Data Frame

In [4]:
## A two dimensional label array ,its similar to table in a database or a spreadsheet .
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [25, 30, 35, 40, 45],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"]
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Phoenix

## indexing and slicing

In [5]:
# using .loc[]
print(df.loc[0]) # accessing the first row by indexing

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [6]:
# Accessing the name column 
print(df.loc[:,"Name"])

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [8]:
# using iloc 
print(df.iloc[0,1]) # Accesing the value on first row second column

25

In [10]:
# Boolean Indexing 
print(df[df['Age']>30])  # filter rows where age is greater than 30

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45  Phoenix

## Handling Missing Data

Missing Data: Common in real-world datasets, and Pandas provides several ways to handle it.

Key Points:

.isnull(): Detect missing values.
.dropna(): Drop rows/columns with missing values.
.fillna(): Fill missing values with a specified value or method.
.interpolate(): Fill missing values using interpol

In [12]:
# Introducing missing values
df.loc[2, "Age"] = None
df.loc[4, "City"] = None
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   NaN      Chicago
3    David  40.0      Houston
4      Eva  45.0         None

In [14]:
## detecting missing values 
# print(df.isnull())  # one way 

print(df.isnull().sum()) # another method

Name    0
Age     1
City    1
dtype: int64

In [15]:
## Dropping rows with missing value 
df_dopped=df.dropna()
print(df_dopped)

    Name   Age         City
0  Alice  25.0     New York
1    Bob  30.0  Los Angeles
3  David  40.0      Houston

In [16]:
# Filling missing data
df_filled = df.fillna({"Age": df["Age"].mean(), "City": "Unknown"})
print(df_filled)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0      Houston
4      Eva  45.0      Unknown

In [17]:
# Interpolating missing data
df_interpolated = df.interpolate()
print(df_interpolated)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0      Houston
4      Eva  45.0         None

C:\Users\basze\AppData\Local\Temp\ipykernel_5216\1279003504.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate()

In [18]:
## pandas Operation 

## marged DataFrame

df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Salary": [50000, 60000]})
merged_df = pd.merge(df, df1, on="Name", how="left")
print(merged_df)

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  30.0  Los Angeles  60000.0
2  Charlie   NaN      Chicago      NaN
3    David  40.0      Houston      NaN
4      Eva  45.0         None      NaN

In [19]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie   NaN      Chicago
3    David  40.0      Houston
4      Eva  45.0         None